[
    {
        "name": "Rahul Sharma",
        "stars": 5,
        "review": "The admission assistance was exceptional! I got into my dream university in Germany with ease and confidence."
    },
    {
        "name": "Priya Patel",
        "stars": 4,
        "review": "The SOP writing service was well-structured and helpful. Slight delay in responses, but overall very satisfied."
    },
    {
        "name": "Amit Kumar",
        "stars": 5,
        "review": "Blocked account setup was handled smoothly. The team was responsive and guided me through every step."
    },
    {
        "name": "Neha Gupta",
        "stars": 5,
        "review": "Visa guidance was spot on! They clarified every small detail, saving me time and unnecessary stress."
    },
    {
        "name": "Vikram Singh",
        "stars": 4,
        "review": "Good university shortlisting support. I received 3 out of 5 admits and felt well-informed throughout."
    },
    {
        "name": "Anjali Mehta",
        "stars": 5,
        "review": "Their application review services were top-notch. My documents were polished and error-free before submission."
    },
    {
        "name": "Rohan Verma",
        "stars": 4,
        "review": "The pre-departure briefing was detailed and very helpful. I just wish the checklist came a bit earlier."
    },
    {
        "name": "Sneha Iyer",
        "stars": 5,
        "review": "Superb LOR drafting support. My professors found the templates useful and were able to personalize them easily."
    },
    {
        "name": "Karan Malhotra",
        "stars": 4,
        "review": "They helped me with APS certification. The process was made simple and all my doubts were resolved quickly."
    },
    {
        "name": "Isha Reddy",
        "stars": 5,
        "review": "Amazing guidance for German language learning resources. Helped me prepare well before arrival."
    },
    {
        "name": "Nikhil Joshi",
        "stars": 5,
        "review": "From SOP to visa interview, the team provided end-to-end support. Very professional and always approachable."
    },
    {
        "name": "Divya Menon",
        "stars": 4,
        "review": "Excellent service for blocked account and health insurance. Just wished for quicker email responses at times."
    },
    {
        "name": "Manav Desai",
        "stars": 5,
        "review": "Their detailed mock interviews really helped boost my confidence for the embassy appointment. Totally worth it!"
    },
    {
        "name": "Tanvi Kapoor",
        "stars": 5,
        "review": "A friend recommended them, and I’m so glad I reached out. Very smooth experience throughout my application."
    },
    {
        "name": "Arjun Nair",
        "stars": 4,
        "review": "Very good support overall. I liked their transparency and step-by-step updates. Would recommend to others."
    }
]